app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    task_id = params[:id].to_i
    @task = Task.find_by(id: task_id)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "due_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Feeling Cute, might delete later"], ["description", "whoopsie!"], ["created_at", "2019-04-11 06:19:30.829358"], ["updated_at", "2019-04-11 06:19:30.829358"], ["due_date", "2019-04-18"]]
---
    task = Task.new(name: params[:task][:name], description: params[:task][:description], due_date: params[:task][:due_date]) # instantiate a new task
    if task.save # save returns true if the database insert succeeds

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "description" = $2, "completion_date" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["name", "Editing Tasks"], ["description", "I'm ready for dinner"], ["completion_date", "2019-04-14"], ["updated_at", "2019-04-14 22:38:10.906879"], ["id", 19]]
---
  def update
    @task = Task.find_by(id: params[:id])

    if @task.nil?
      flash[:error] = "Could not find task with id: #{params[:id]}"
      redirect_to tasks_path
    else @task.update_attributes(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 17]]
---
    task = Task.find_by(id: params[:id])

    if task.nil?
      head :not_found
    else
      task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completed", true], ["completion_date", "2019-04-11"], ["updated_at", "2019-04-12 02:20:44.833093"], ["id", 14]]
---
  def complete
    @task = Task.find_by(id: params[:id])
    if @task[:completed] == false
      @task[:completed] = true
      @task.completion_date = Time.now
    else
      @task[:completed] = false
      @task[:completion_date] = nil
    end
    flash[:success] = 'Status Updated'
    @task.save